// Задание 15
let a;    

a = 10;    
alert(a); 

a = 20;    
alert(a); 

// Задание 17
let b = 1 + 2 + 3;
alert(b); 

// Задание 18 №1
let a1 = 10;
let b1 = 2;

alert(a1+b1)
alert(a1-b1)
alert(a1*b1)
alert(a1/b1)

// Задание 18 №2
let c = 10;
let d = 5;
let result= c + d;

alert(result)

// Задание 18 №3
let a3 = 1;
let b3 = 2;
let c3 = 3;

alert(a3+b3+c3)

// Задание 18 №4
let a4 = 10;
let b4 = 5;
let c4 = a4 - b4;
let d4 = 7;
let result4 = c4 + d4;

alert(result4);

// Задание 19 №1
// let a = 5 + 5 * 3;
// alert(a);
// Результат выведния будет = 20

// Задание 19 №2
// let a = 5 + 5 * 3 + 3;
// alert(a);
// Результат выведния будет = 23

// Задание 19 №3
// let a = 8 / 2 + 2;
// alert(a);
// Результат выведния будет = 6

// Задание 19 №4
// let a = 8 + 2 / 2;
// alert(a);
// Результат выведния будет = 9

// Задание 20 №1
// let a = 8 / 2 * 2;
// alert(a);
// Результат выведния будет = 8

// Задание 20 №2
// let a = 8 * 4 / 2 / 2
// alert(a);
// Результат выведния будет = 4

// Задание 21 №1
// let a = (2 + 3) * (2 + 3);
// alert(a);
// Результат выведния будет = 25

// Задание 21 №2
// let a = (2 + 3) * 2 + 3;
// alert(a);
// Результат выведния будет = 15

// Задание 21 №3
// let a = 2 * (2 + 4 * (3 + 1));
// alert(a);
// Результат выведния будет = 36

// Задание 21 №4
// let a = 2 * 8 / 4;
// alert(a);
// Результат выведния будет = 4

// Задание 21 №5
// let a = let a = (2 * 8) / 4;
// alert(a);
// Результат выведния будет = 4

// Задание 21 №6
//let a = 2 * (8 / 4);
// alert(a);
// Результат выведния будет = 4

// Задание 22 №1
let a22 = 1.5;
let b22 = 0.75;

alert(a22+b22);

// Задание 23 №1
let a23_1 = -5;

alert(a23_1);

// Задание 23 №2
let a23_2 = 50;

alert(-a23_2);

// Задание 25 №1
// let a = 13;
// let b = 5;
//Остаток от деления 3

// Задание 26 №1
let a26 = 2;

alert(a26 ** 10);

// Задание 27 №1
// let a = 3 * 2 ** 3;
// alert(a);
// Результат выведния будет = 24

// Задание 27 №2
// let a = (3 * 2) ** 3;
// alert(a);
// Результат выведния будет = 216

// Задание 27 №3
// let a = 3 * 2 ** (3 + 1);
// alert(a);
// Результат выведния будет = 48

// Задание 27 №4
// let a = 2 ** 3 * 3;
// alert(a);
// Результат выведния будет = 24

// Задание 27 №5
// let a = 3 * 2 ** 3 * 3;
// alert(a);
// Результат выведния будет = 72