// Задание 286 №1
console.log('Результат задачи 286 №1:');
let arr286 = [1, 2, 3, 4, 5];
function func(num1, num2, num3, num4, num5) {
	return num1 + num2 + num3 + num4 + num5;
}
console.log(func(...arr286));

// Задание 287 №1
// function func(n1, n2, n3, n4, n5, n6, n7, n8) {
// 	return (n1 + n2 + n3 + n4) * (n5 + n6 + n7 + n8);
// }
// console.log( func(1, ...[2, 3, 4], 5, ...[6], ...[7, 8]) ); 
// Результатом выведения в консоль будет: 260

// Задание 288 №1
console.log('Результат задачи 288 №1:');
let arr288 = [-10, -5, 0, 5, 10];
console.log(Math.min(...arr288));

// Задание 289 №1
// let arr1 = [1, 2, 3];
// let arr2 = [4, 5, 6];
// let arr  = ['a', ...arr1, 'b', 'c', ...arr2];
// console.log(arr); 
// Результатом выведения в консоль будет: ['a', 1, 2, 3, 'b', 'c', 4, 5, 6]

// Задание 289 №2
// arr1 = [1, 2, 3];
// arr2 = [4, 5, 6];
// arr  = ['a', ...arr1, ...arr1, 'b', 'c'];
// console.log(arr);
// Результатом выведения в консоль будет: ['a', 1, 2, 3, 1, 2, 3, 'b', 'c']

// Задание 289 №3
// arr1 = [1, 2, 3];
// arr2 = [...arr1, 4, 5, 6];
// arr  = ['a', 'b', 'c', ...arr2];
// console.log(arr);
// Результатом выведения в консоль будет: ['a', 'b', 'c', 1, 2, 3, 4, 5, 6]

// Задание 289 №4
// arr1 = [1, 2, 3];
// arr2 = [...arr1, 4, 5, 6];
// let arr3 = [...arr2, 7, 8, 9];
// arr  = [0, ...arr3];
// console.log(arr);
// Результатом выведения в консоль будет: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

// Задание 289 №5
// arr1 = [1, 2, 3];
// arr2 = [...arr1];
// console.log(arr2);
// Результатом выведения в консоль будет: [1, 2, 3]

// Задание 290 №1
// let arr = [...'12345'];
// console.log(arr); 
// Результатом выведения в консоль будет: ['1', '2', '3', '4', '5']

// Задание 290 №2
// let arr = ['a', ...'12345'];
// console.log(arr);
// Результатом выведения в консоль будет: ['a', '1', '2', '3', '4', '5']

// Задание 290 №3
// let arr = [...'12345', ...'56789'];
// console.log(arr);
// Результатом выведения в консоль будет: ['1', '2', '3', '4', '5', '5', '6', '7', '8', '9']

// Задание 290 №4
// let arr1 = ['a', 'b', 'c'];
// let arr2 = [...arr1, ...'12345'];
// console.log(arr2);
// Результатом выведения в консоль будет: ['a', 'b', 'c', '1', '2', '3', '4', '5']